tutorials/steadyIncompressible/laminarPipe/openfoam-v13/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          192;
        startFace       12864;
    }
    outlet
    {
        type            patch;
        nFaces          192;
        startFace       13056;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          768;
        startFace       13248;
    }
)

// ************************************************************************* //
